# Menggabungkan Data

In [1]:
import pandas as pd
pd.__version__

'2.2.2'

In [2]:
data = {
    'emp_id' : ['1','2','3','4','5'],
    'first_name' : ['Jason', 'Andy', 'Allen', 'John', 'Amy'],
    'last_name' : ['Larkin', 'Jacob', 'A', 'Snow', 'Jackson']
}

df1 = pd.DataFrame(data, columns=['emp_id', 'first_name', 'last_name'])
df1

  emp_id first_name last_name
0      1      Jason    Larkin
1      2       Andy     Jacob
2      3      Allen         A
3      4       John      Snow
4      5        Amy   Jackson

In [3]:
data = {
    'emp_id' : ['4','5','6','7'],
    'first_name' : ['James', 'Shize', 'Kim', 'Jose'],
    'last_name' : ['Alexander', 'Suma', 'Shoe', 'Murinho']
}

df2 = pd.DataFrame(data, columns=['emp_id', 'first_name', 'last_name'])
df2

  emp_id first_name  last_name
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Shoe
3      7       Jose    Murinho

In [4]:
# Concat
df = pd.concat([df1, df2])
df

  emp_id first_name  last_name
0      1      Jason     Larkin
1      2       Andy      Jacob
2      3      Allen          A
3      4       John       Snow
4      5        Amy    Jackson
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Shoe
3      7       Jose    Murinho

In [ ]:
# Append
df1.append(df2)

In [7]:
# Gabungkan dua dataframe di sepanjang kolom
df = pd.concat([df1, df2], axis=1)
df

  emp_id first_name last_name emp_id first_name  last_name
0      1      Jason    Larkin      4      James  Alexander
1      2       Andy     Jacob      5      Shize       Suma
2      3      Allen         A      6        Kim       Shoe
3      4       John      Snow      7       Jose    Murinho
4      5        Amy   Jackson    NaN        NaN        NaN

In [8]:
# Gabungkan dua dataframe berdasarkan nilai emp_id
# dalam hal ini hanya emp_id yang ada di kedua tabel yang akan di gabungkan

pd.merge(df1, df2, on='emp_id') # seperti inner join

  emp_id first_name_x last_name_x first_name_y last_name_y
0      4         John        Snow        James   Alexander
1      5          Amy     Jackson        Shize        Suma